Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70Q21.xml
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 6)" name="USBHS_HSTDMANXTDSC6" offset="0x760" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 6)" name="USBHS_HSTDMAADDRESS6" offset="0x764" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 6)" name="USBHS_HSTDMACONTROL6" offset="0x768" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control (OUT transfers only)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 6)" name="USBHS_HSTDMASTATUS6" offset="0x76C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 7)" name="USBHS_HSTDMANXTDSC7" offset="0x770" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 7)" name="USBHS_HSTDMAADDRESS7" offset="0x774" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 7)" name="USBHS_HSTDMACONTROL7" offset="0x778" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control (OUT transfers only)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 7)" name="USBHS_HSTDMASTATUS7" offset="0x77C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="General Control Register" name="USBHS_CTRL" offset="0x0800" rw="RW" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt Enable" mask="0x00000010" name="RDERRE"/>
          <bitfield caption="Freeze USB Clock" mask="0x00004000" name="FRZCLK"/>
          <bitfield caption="USBHS Enable" mask="0x00008000" name="USBE"/>
          <bitfield caption="USBHS Mode" mask="0x02000000" name="UIMOD" values="USBHS_CTRL__UIMOD"/>
        </register>
        <register caption="General Status Register" name="USBHS_SR" offset="0x0804" rw="R" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt (Host mode only)" mask="0x00000010" name="RDERRI"/>
          <bitfield caption="VBus Request (Host mode only)" mask="0x00000200" name="VBUSRQ"/>
          <bitfield caption="Speed Status (Device mode only)" mask="0x00003000" name="SPEED" values="USBHS_SR__SPEED"/>
          <bitfield caption="UTMI Clock Usable" mask="0x00004000" name="CLKUSABLE"/>
        </register>
        <register caption="General Status Clear Register" name="USBHS_SCR" offset="0x0808" rw="W" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt Clear" mask="0x00000010" name="RDERRIC"/>
          <bitfield caption="VBus Request Clear" mask="0x00000200" name="VBUSRQC"/>
        </register>
        <register caption="General Status Set Register" name="USBHS_SFR" offset="0x080C" rw="W" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt Set" mask="0x00000010" name="RDERRIS"/>
          <bitfield caption="VBus Request Set" mask="0x00000200" name="VBUSRQS"/>
        </register>
        <register caption="General Test A1 Register" name="USBHS_TSTA1" offset="0x0810" rw="RW" size="4">
          <bitfield caption="Counter A" mask="0x00007FFF" name="CounterA"/>
          <bitfield caption="Load CounterA" mask="0x00008000" name="LoadCntA"/>
          <bitfield caption="Counter B" mask="0x003F0000" name="CounterB"/>
          <bitfield caption="Load CounterB" mask="0x00800000" name="LoadCntB"/>
          <bitfield caption="SOF Counter Max" mask="0x7F000000" name="SOFCntMa1"/>
          <bitfield caption="Load SOF Counter" mask="0x80000000" name="LoadSOFCnt"/>
        </register>
        <register caption="General Test A2 Register" name="USBHS_TSTA2" offset="0x0814" rw="RW" size="4">
          <bitfield caption="Full Detach Enable" mask="0x00000001" name="FullDetachEn"/>
          <bitfield caption="HS Serial Mode" mask="0x00000002" name="HSSerialMode"/>
          <bitfield caption="Loop-back Mode" mask="0x00000004" name="LoopBackMode"/>
          <bitfield caption="Disable Gated Clock" mask="0x00000008" name="DisableGatedClock"/>
          <bitfield caption="Force SuspendM to 1" mask="0x00000010" name="ForceSuspendMTo1"/>
          <bitfield caption="Bypass DPLL" mask="0x00000020" name="ByPassDpll"/>
          <bitfield caption="Host HS Disconnect Disable" mask="0x00000040" name="HostHSDisconnectDisable"/>
          <bitfield caption="Force HS Reset to 50 ms" mask="0x00000080" name="ForceHSRst_50ms"/>
          <bitfield caption="Remove Pull-up When TX" mask="0x00000200" name="RemovePUWhenTX"/>
        </register>
        <register caption="General Version Register" name="USBHS_VERSION" offset="0x0818" rw="R" size="4">
          <bitfield caption="Version Number" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x000F0000" name="MFN"/>
        </register>
        <register caption="General Finite State Machine Register" name="USBHS_FSM" offset="0x082C" rw="R" size="4">
          <bitfield caption="Dual Role Device State" mask="0x0000000F" name="DRDSTATE" values="USBHS_FSM__DRDSTATE"/>
        </register>
      </register-group>
      <value-group caption="" name="USBHS_DEVCTRL__SPDCONF">
        <value caption="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." name="NORMAL" value="0x0"/>
        <value caption="For a better consumption, if high speed is not needed." name="LOW_POWER" value="0x1"/>
        <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
        <value caption="The peripheral remains in Full-speed mode whatever the host speed capability." name="FORCED_FS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
